---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalGapWarning
source: html/d3e02170-4359-bff3-d567-08884ad509e4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalGapWarning Property

Detected physical connection between Structural Elements, but did not detect Analytical intersection.

## Syntax (C#)
```csharp
public static FailureDefinitionId AnalyticalGapWarning { get; }
```